In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.read_csv('/content/messy_customer_sales_data.csv')

In [ ]:
# Question 1:Load the CSV file into Pandas and display the first 5 rows of the dataset.
df.head(5)

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
0,CUST4371,Paul Wilson,m,52.0,KOLKATA,2025-06-26,2025-05-17,26944.0,1.0,peckvictoria@example.com,2131107701,India
1,CUST5957,Jason Thomas,M,51.0 years,NaN,2021-02-17,2025-07-22,44152.0,2.0,owensanthony@example.com,1080761560,india
2,CUST3754,Brittney Martinez,F,62.0,hyderabad,2023-11-05,2024-12-08,31745.0,2.0,tara39@example.org,8981006345,India
3,CUST2934,Brenda Pierce,FEMALE,40.0,hyderabad,2022-03-13,2025-10-02,39674.0,1.0,berrynancy@example.org,8228064204,india
4,CUST5683,Matthew Carroll,f,41.0,CHENNAI,2024-04-05,2024-12-15,NaN,8.0,denise84@example.org,2665569480,India

In [ ]:
# Question 2:Display the last 5 rows of the dataset.
df.tail(5)

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
10195,CUST10767,Robert Lewis,female,35.0 years,delhi,2020-12-08,2025-01-25,24167.0,9.0,barrycrane@example.net,5004696571,InDia
10196,NaN,Diane Evans,M,53.0,bangalore,2023-12-31,2025-05-07,11639.0,7.0,lisadennis@example.net,5200349941,IND
10197,CUST6315,Joshua Martinez,m,25.0,hyderabad,2022-02-15,2025-01-11,43832.0,2.0,kelli74@example.org,8147428496,India
10198,CUST4812,Sarah Miller,FEMALE,55.0,NaN,2021-03-16,2025-05-14,18827.0,10.0,dawn84@example.org,2987564247,InDia
10199,CUST6588,David Potter,female,34.0,HYDERABAD,2020-10-12,2025-06-27,35211.0,10.0,kochjonathan@example.org,1926206725,India

In [ ]:
# Question 3:Find the number of rows and columns in the dataset.
print("Rows:", len(df))
print("Columns:", len(df.columns))

Rows: 10200
Columns: 12

In [ ]:
# Question 4:Display the column names of the dataset.
df.columns

Index(['Customer_ID', 'Name', 'Gender', 'Age', 'City', 'Signup_Date',
       'Last_Purchase_Date', 'Purchase_Amount', 'Feedback_Score', 'Email',
       'Phone_Number', 'Country'],
      dtype='object')

In [ ]:
# Question 5:Use one command to check data types, missing values, and memory usage.
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10200 entries, 0 to 10199
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer_ID         9177 non-null   object
 1   Name                10200 non-null  object
 2   Gender              9174 non-null   object
 3   Age                 9249 non-null   object
 4   City                9184 non-null   object
 5   Signup_Date         10200 non-null  object
 6   Last_Purchase_Date  9188 non-null   object
 7   Purchase_Amount     9179 non-null   float64
 8   Feedback_Score      9177 non-null   float64
 9   Email               10200 non-null  object
 10  Phone_Number        10200 non-null  int64
 11  Country             9468 non-null   object
dtypes: float64(2), int64(1), object(9)
memory usage: 956.4+ KB
None

In [ ]:
# Question 6:Select and display Customer_ID, Name, City, and Purchase_Amount columns.

df[["Name","Customer_ID","City","Purchase_Amount"]]

                    Name Customer_ID         City  Purchase_Amount
0            Paul Wilson    CUST4371     KOLKATA           26944.0
1           Jason Thomas    CUST5957          NaN          44152.0
2      Brittney Martinez    CUST3754   hyderabad           31745.0
3          Brenda Pierce    CUST2934   hyderabad           39674.0
4        Matthew Carroll    CUST5683     CHENNAI               NaN
...                  ...         ...          ...              ...
10195       Robert Lewis   CUST10767       delhi           24167.0
10196        Diane Evans         NaN   bangalore           11639.0
10197    Joshua Martinez    CUST6315   hyderabad           43832.0
10198       Sarah Miller    CUST4812          NaN          18827.0
10199       David Potter    CUST6588   HYDERABAD           35211.0

[10200 rows x 4 columns]

In [ ]:
# Question 7:Display details of customers who belong to the city CHENNAI.
df.loc[df["City"]==" CHENNAI "]

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
4,CUST5683,Matthew Carroll,f,41.0,CHENNAI,2024-04-05,2024-12-15,NaN,8.0,denise84@example.org,2665569480,India
8,CUST5189,Sabrina Miller,F,40.0 years,CHENNAI,2025-07-07,2024-10-30,NaN,10.0,shepardcolton@example.net,6233441825,India
92,CUST8354,Darren Thompson,NaN,25.0,CHENNAI,2021-07-06,2025-08-26,43120.0,4.0,dennisrodriguez@example.com,3391525083,India
107,CUST8953,Chad Palmer,F,20.0,CHENNAI,2023-09-02,2025-02-18,3951.0,2.0,jenniferrodriguez@example.com,4492603156,India
112,CUST5476,Timothy Chavez,F,44.0,CHENNAI,2023-12-22,2025-05-04,38141.0,7.0,romerostacy@example.org,2960332874,India
...,...,...,...,...,...,...,...,...,...,...,...,...
10104,CUST10185,Jason Neal,male,40.0,CHENNAI,2021-09-15,2025-09-13,34229.0,8.0,william77@example.com,5932376020,India
10117,CUST5333,Kelly Weiss,M,61.0,CHENNAI,2024-02-07,2024-12-31,NaN,3.0,deannamccall@example.net,942942942,India
10131,CUST4058,Ryan Myers,female,25.0,CHENNAI,2021-05-29,2024-12-12,NaN,3.0,amberbaker@example.org,1072319959,India
10143,CUST9308,Mark Jackson,male,43.0,CHENNAI,2021-01-21,NaN,45346.0,4.0,ronaldfritz@example.org,2370984713,India
10188,NaN,Ashley Dunn,MALE,67.0,CHENNAI,2023-03-07,2024-12-09,45534.0,9.0,loribenson@example.com,5556223952,india

In [ ]:
# Question 8:Display all customers whose Country is India.
df[df["Country"]=="India"]

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
0,CUST4371,Paul Wilson,m,52.0,KOLKATA,2025-06-26,2025-05-17,26944.0,1.0,peckvictoria@example.com,2131107701,India
2,CUST3754,Brittney Martinez,F,62.0,hyderabad,2023-11-05,2024-12-08,31745.0,2.0,tara39@example.org,8981006345,India
4,CUST5683,Matthew Carroll,f,41.0,CHENNAI,2024-04-05,2024-12-15,NaN,8.0,denise84@example.org,2665569480,India
6,CUST3651,Laura Vincent,male,18.0,BANGALORE,2024-06-16,2025-04-25,NaN,3.0,ymiranda@example.net,6917110630,India
8,CUST5189,Sabrina Miller,F,40.0 years,CHENNAI,2025-07-07,2024-10-30,NaN,10.0,shepardcolton@example.net,6233441825,India
...,...,...,...,...,...,...,...,...,...,...,...,...
10192,NaN,Amanda Arroyo,MALE,65.0,delhi,2020-12-08,2025-01-14,45692.0,6.0,traci77@example.com,7969675601,India
10193,CUST6352,Isaiah Terry,f,26.0,kolkata,2023-03-04,2025-06-30,43655.0,6.0,lopezleonard@example.net,7694723210,India
10194,CUST6146,Cody Thompson,f,40.0,NaN,2024-08-21,2024-10-26,35101.0,1.0,mitchellrivera@example.net,6380823112,India
10197,CUST6315,Joshua Martinez,m,25.0,hyderabad,2022-02-15,2025-01-11,43832.0,2.0,kelli74@example.org,8147428496,India
10199,CUST6588,David Potter,female,34.0,HYDERABAD,2020-10-12,2025-06-27,35211.0,10.0,kochjonathan@example.org,1926206725,India

In [ ]:
# Question 9:Display customers whose Purchase_Amount is greater than 30,000.
df[df["Purchase_Amount"]>30000]

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
1,CUST5957,Jason Thomas,M,51.0 years,NaN,2021-02-17,2025-07-22,44152.0,2.0,owensanthony@example.com,1080761560,india
2,CUST3754,Brittney Martinez,F,62.0,hyderabad,2023-11-05,2024-12-08,31745.0,2.0,tara39@example.org,8981006345,India
3,CUST2934,Brenda Pierce,FEMALE,40.0,hyderabad,2022-03-13,2025-10-02,39674.0,1.0,berrynancy@example.org,8228064204,india
10,CUST3260,Jason Mack,MALE,32.0,HYDERABAD,2024-08-14,2025-01-20,48115.0,8.0,campbellrobert@example.com,8366856220,India
13,CUST7740,Jose Gross,female,22.0,Mumbai,2023-10-14,2025-04-24,41323.0,2.0,heather45@example.net,5890325488,India
...,...,...,...,...,...,...,...,...,...,...,...,...
10192,NaN,Amanda Arroyo,MALE,65.0,delhi,2020-12-08,2025-01-14,45692.0,6.0,traci77@example.com,7969675601,India
10193,CUST6352,Isaiah Terry,f,26.0,kolkata,2023-03-04,2025-06-30,43655.0,6.0,lopezleonard@example.net,7694723210,India
10194,CUST6146,Cody Thompson,f,40.0,NaN,2024-08-21,2024-10-26,35101.0,1.0,mitchellrivera@example.net,6380823112,India
10197,CUST6315,Joshua Martinez,m,25.0,hyderabad,2022-02-15,2025-01-11,43832.0,2.0,kelli74@example.org,8147428496,India
10199,CUST6588,David Potter,female,34.0,HYDERABAD,2020-10-12,2025-06-27,35211.0,10.0,kochjonathan@example.org,1926206725,India

In [ ]:
# Question 10:Count how many customers are male and female.
df['Gender'].value_counts()

Gender
f         1184
M         1171
m         1163
F         1157
MALE      1131
female    1128
male      1121
FEMALE    1119
Name: count, dtype: int64

In [ ]:
# Question 11:Identify how many missing values are present in each column.
df.isnull().sum()

Customer_ID           1023
Name                     0
Gender                1026
Age                    951
City                  1016
Signup_Date              0
Last_Purchase_Date    1012
Purchase_Amount       1021
Feedback_Score        1023
Email                    0
Phone_Number             0
Country                732
dtype: int64

In [ ]:
# Question 12:Find customers whose Purchase_Amount is missing.
df.isnull().sum().Purchase_Amount

np.int64(1021)

In [ ]:
# Question 13: Replace missing values in Purchase_Amount with the average value.
x = df["Purchase_Amount"].mean()
df.fillna({"Purchase_Amount":x},inplace = True)

In [ ]:
df.isnull().sum().Purchase_Amount

np.int64(0)

In [ ]:
# Question 14:Check how many values are missing in the City column.
df.isnull().sum().City

np.int64(1016)

In [ ]:
# Question 15:Remove rows where Age is missing
df.dropna(subset =['Age'])

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
0,CUST4371,Paul Wilson,m,52.0,KOLKATA,2025-06-26,2025-05-17,26944.000000,1.0,peckvictoria@example.com,2131107701,India
1,CUST5957,Jason Thomas,M,51.0 years,NaN,2021-02-17,2025-07-22,44152.000000,2.0,owensanthony@example.com,1080761560,india
2,CUST3754,Brittney Martinez,F,62.0,hyderabad,2023-11-05,2024-12-08,31745.000000,2.0,tara39@example.org,8981006345,India
3,CUST2934,Brenda Pierce,FEMALE,40.0,hyderabad,2022-03-13,2025-10-02,39674.000000,1.0,berrynancy@example.org,8228064204,india
4,CUST5683,Matthew Carroll,f,41.0,CHENNAI,2024-04-05,2024-12-15,29090.128772,8.0,denise84@example.org,2665569480,India
...,...,...,...,...,...,...,...,...,...,...,...,...
10195,CUST10767,Robert Lewis,female,35.0 years,delhi,2020-12-08,2025-01-25,24167.000000,9.0,barrycrane@example.net,5004696571,InDia
10196,NaN,Diane Evans,M,53.0,bangalore,2023-12-31,2025-05-07,11639.000000,7.0,lisadennis@example.net,5200349941,IND
10197,CUST6315,Joshua Martinez,m,25.0,hyderabad,2022-02-15,2025-01-11,43832.000000,2.0,kelli74@example.org,8147428496,India
10198,CUST4812,Sarah Miller,FEMALE,55.0,NaN,2021-03-16,2025-05-14,18827.000000,10.0,dawn84@example.org,2987564247,InDia
10199,CUST6588,David Potter,female,34.0,HYDERABAD,2020-10-12,2025-06-27,35211.000000,10.0,kochjonathan@example.org,1926206725,India

In [ ]:
# Question 16:Convert all values in the Gender column to Male/Female format.
df['Gender'] = df['Gender'].str.strip().str.lower().map({
    'm': 'Male',
    'male': 'Male',
    'f': 'Female',
    'female': 'Female'
})

In [ ]:
# Question 17: Clean the City column (uppercase and remove extra spaces).
df['City'] = df['City'].str.strip().str.upper()

In [ ]:
# QUESTION 18:Standardize the Country column so all values become India.
df['Country'] = 'India'

In [ ]:
# Question 19:Convert Signup_Date column into datetime format.
df['Signup_Date']= pd.to_datetime(df['Signup_Date'] )

In [ ]:
# Question 20:Convert Last_Purchase_Date column into datetime format.
myvar = pd.to_datetime(df['Last_Purchase_Date'],format = 'mixed' )
print(myvar)

0       2025-05-17
1       2025-07-22
2       2024-12-08
3       2025-10-02
4       2024-12-15
           ...
10195   2025-01-25
10196   2025-05-07
10197   2025-01-11
10198   2025-05-14
10199   2025-06-27
Name: Last_Purchase_Date, Length: 10200, dtype: datetime64[ns]

In [ ]:
# Question 21:Find the average Purchase_Amount of all customers
average = df['Purchase_Amount'].mean()
print(average)

29090.128772197408

In [ ]:
# Question 22:Find the average Purchase_Amount city-wise.
average=df.groupby('City')['Purchase_Amount'].mean()
print(average)

City
BANGALORE    32284.622393
CHENNAI      24509.112022
DELHI        25505.585364
HYDERABAD    25548.370515
KOLKATA      31109.686968
MUMBAI       38002.210305
Name: Purchase_Amount, dtype: float64

In [ ]:
# Question 23:Count how many customers belong to each City.
City =  df['City'].value_counts()
print(City)

City
MUMBAI       1557
KOLKATA      1553
CHENNAI      1531
BANGALORE    1519
HYDERABAD    1514
DELHI        1510
Name: count, dtype: int64

In [ ]:
# Question 24:Find customers whose Purchase_Amount is greater than the overall average.
average = df['Purchase_Amount'].mean()

overall = df[df["Purchase_Amount"]>average]

print("average:",average)

print("overall:",overall)

average: 29090.128772197408
overall:       Customer_ID               Name  Gender         Age       City  \
1        CUST5957       Jason Thomas    Male  51.0 years        NaN
2        CUST3754  Brittney Martinez  Female        62.0  HYDERABAD
3        CUST2934      Brenda Pierce  Female        40.0  HYDERABAD
10       CUST3260         Jason Mack    Male        32.0  HYDERABAD
13       CUST7740         Jose Gross  Female        22.0     MUMBAI
...           ...                ...     ...         ...        ...
10192         NaN      Amanda Arroyo    Male        65.0      DELHI
10193    CUST6352       Isaiah Terry  Female        26.0    KOLKATA
10194    CUST6146      Cody Thompson  Female        40.0        NaN
10197    CUST6315    Joshua Martinez    Male        25.0  HYDERABAD
10199    CUST6588       David Potter  Female        34.0  HYDERABAD

      Signup_Date Last_Purchase_Date  Purchase_Amount  Feedback_Score  \
1      2021-02-17         2025-07-22          44152.0             2.0
2      2023-11-05         2024-12-08          31745.0             2.0
3      2022-03-13         2025-10-02          39674.0             1.0
10     2024-08-14         2025-01-20          48115.0             8.0
13     2023-10-14         2025-04-24          41323.0             2.0
...           ...                ...              ...             ...
10192  2020-12-08         2025-01-14          45692.0             6.0
10193  2023-03-04         2025-06-30          43655.0             6.0
10194  2024-08-21         2024-10-26          35101.0             1.0
10197  2022-02-15         2025-01-11          43832.0             2.0
10199  2020-10-12         2025-06-27          35211.0            10.0

                            Email  Phone_Number Country
1        owensanthony@example.com    1080761560   India
2              tara39@example.org    8981006345   India
3          berrynancy@example.org    8228064204   India
10     campbellrobert@example.com    8366856220   India
13          heather45@example.net    5890325488   India
...                           ...           ...     ...
10192         traci77@example.com    7969675601   India
10193    lopezleonard@example.net    7694723210   India
10194  mitchellrivera@example.net    6380823112   India
10197         kelli74@example.org    8147428496   India
10199    kochjonathan@example.org    1926206725   India

[3723 rows x 12 columns]

In [ ]:
# Question 25: Create a new column Customer_Type (High Value / Regular)
average = df['Purchase_Amount'].mean()


df['Customer_Type'] = df['Purchase_Amount'].apply(
    lambda x: 'High Value' if x > average else 'Regular'
)
print("Overall Average:", average)
print(df)

Overall Average: 29090.128772197408
      Customer_ID               Name  Gender         Age       City  \
0        CUST4371        Paul Wilson    Male        52.0    KOLKATA
1        CUST5957       Jason Thomas    Male  51.0 years        NaN
2        CUST3754  Brittney Martinez  Female        62.0  HYDERABAD
3        CUST2934      Brenda Pierce  Female        40.0  HYDERABAD
4        CUST5683    Matthew Carroll  Female        41.0    CHENNAI
...           ...                ...     ...         ...        ...
10195   CUST10767       Robert Lewis  Female  35.0 years      DELHI
10196         NaN        Diane Evans    Male        53.0  BANGALORE
10197    CUST6315    Joshua Martinez    Male        25.0  HYDERABAD
10198    CUST4812       Sarah Miller  Female        55.0        NaN
10199    CUST6588       David Potter  Female        34.0  HYDERABAD

      Signup_Date Last_Purchase_Date  Purchase_Amount  Feedback_Score  \
0      2025-06-26         2025-05-17     26944.000000             1.0
1      2021-02-17         2025-07-22     44152.000000             2.0
2      2023-11-05         2024-12-08     31745.000000             2.0
3      2022-03-13         2025-10-02     39674.000000             1.0
4      2024-04-05         2024-12-15     29090.128772             8.0
...           ...                ...              ...             ...
10195  2020-12-08         2025-01-25     24167.000000             9.0
10196  2023-12-31         2025-05-07     11639.000000             7.0
10197  2022-02-15         2025-01-11     43832.000000             2.0
10198  2021-03-16         2025-05-14     18827.000000            10.0
10199  2020-10-12         2025-06-27     35211.000000            10.0

                          Email  Phone_Number Country Customer_Type
0      peckvictoria@example.com    2131107701   India       Regular
1      owensanthony@example.com    1080761560   India    High Value
2            tara39@example.org    8981006345   India    High Value
3        berrynancy@example.org    8228064204   India    High Value
4          denise84@example.org    2665569480   India       Regular
...                         ...           ...     ...           ...
10195    barrycrane@example.net    5004696571   India       Regular
10196    lisadennis@example.net    5200349941   India       Regular
10197       kelli74@example.org    8147428496   India    High Value
10198        dawn84@example.org    2987564247   India       Regular
10199  kochjonathan@example.org    1926206725   India    High Value

[10200 rows x 13 columns]

**#Complete my project.**